backend/app/controllers/customized_formulation_controller.rb

SELECT  "customized_formulations".* FROM "customized_formulations" WHERE "customized_formulations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      @customForm = CustomizedFormulation.find_by_id(params[:id])