backend/app/controllers/api/customized_formulation_controller.rb

    def create
        @customized_formulation = CustomizedFormulation.new(
            name: params[:name],
            address: params[:address],
            birthday: params[:birthday],
            ingredients: params[:ingredients]
        )
        if (@customized_formulation.save)
---
INSERT INTO "customized_formulations" ("name", "address", "birthday", "ingredients", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"