backend/app/controllers/api/formulation_ingredients_controller.rb

    def index
      respond_with :api, FormulationIngredient.all
---
SELECT "formulation_ingredients".* FROM "formulation_ingredients" WHERE "formulation_ingredients"."formulation_id" IS NULL

    def show_ingredients
      puts params[:formulation_id]
      @filtered_query = FormulationIngredient.where(formulation_id: params[:formulation_id])
---
SELECT "formulation_ingredients".* FROM "formulation_ingredients" WHERE "formulation_ingredients"."formulation_id" = $1  [["formulation_id", 1]]