backend/app/controllers/api/formulations_controller.rb

SELECT "formulations".* FROM "formulations"
---
  def index
    respond_with :api, Formulation.all