backend/app/controllers/api/ingredients_controller.rb

    def index
      respond_with :api, Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"